examples/Voronoi_mothod/3D-2GVM-assembly/openfoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;
vertices 
 ( 
(0.0 0.0 0.0)
(.01009417 0.0 0.0)
(.01009417 0.006425477 0.0)
(0.0 0.006425477 0.0)
(0.0 0.0 0.00643618)
(.01009417 0.0 0.00643618)
(.01009417 0.006425477 0.00643618)
(0.0 0.006425477 0.00643618)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)(11 7 7) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
	    (0 4 7 3)
            
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    wall1
    {
        type cyclic;
	neighbourPatch wall2;
        faces
        (
            (0 3 2 1)
        );  
    }
    wall2
    {
        type cyclic;
	neighbourPatch wall1;
        faces
        (
            (4 5 6 7)
        );  
    }
    wall3
    {
        type cyclic;
	neighbourPatch wall4;
        faces
        (
            (1 5 4 0)
        );  
    }
    wall4
    {
        type cyclic;
	neighbourPatch wall3;
        faces
        (
            (3 7 6 2)
        );  
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
