examples/Voronoi_mothod/3D-2GVM-assembly/openfoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    volVectorField;
    object   U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions   [0 1 -2 0 0 0 0];

internalField    uniform (0 0 0);

boundaryField
{
    inlet
    {
        type calculated;
 	value $internalField;
    }
    outlet
    {
        type calculated;
	value $internalField;
    }

    wall1
    {
	type cyclic;
    }
    wall2
    {
	type cyclic;
    }
    wall3
    {
	type cyclic;
    }
    wall4
    {
	type cyclic;
    }
}
// ************************************************************************* //
