examples/Voronoi_mothod/3D-2GVM-assembly/openfoam/0/Ub
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  2.2.2                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object Ub;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [ 0 1 -2 0 0 0 0 ];

internalField uniform (0 0 0);

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (2e-4 0.0 0.0);
//	type            interstitialInletVelocity;
//        alpha          alpha; 
//        inletVelocity   uniform (0 0 .73);
//	value		uniform (0 0 .73);
    }
    outlet
    {
        type zeroGradient;
    }
    wall1
    {
	type cyclic;
    }
    wall2
    {
	type cyclic;
    }
    wall3
    {
	type cyclic;
    }
    wall4
    {
	type cyclic;
    }
}
// ************************************************************************* //
